class SEARCH_LIST:
    search_name = ["工事名", "工事場所", "工期","担当部局","開札の日時及び場所", "申請書及"]
    special_list = ["工期", "開札の日時及び場所", "申請書及"]#"入札書締切日時"
    resolve_list = ["入札件名","施設名","需要場所(住所)","質問箇所 所属/担当者","資格申請送付先",\
                    "入札書送付先","入札書送付先 部署/担当者名"]
    tag_name = ['調達年度', '都道府県', '入札件名', '施設名', '需要場所(住所)', '調達開始日', \
        '調達終了日', '公告日', '仕様書交付期限', '質問票締切日時', '資格申請締切日時', \
            '入札書締切日時', '開札日時', '質問箇所 所属/担当者', '質問箇所 TEL/FAX | TEL/FAX', \
                '資格申請送付先', '資格申請送付先 部署/担当者名', '入札書送付先', \
                    '入札書送付先 部署/担当者名', '開札場所']
    
    tag_dict = {
        '[PAD]' : 0,
        '[CLS]': 1,
        '[SEP]': 2,
        '入札件名' : 3,
        '施設名' : 4, 
        '需要場所(住所)' : 5, 
        '調達開始日' : 6, 
        '調達終了日' : 7, 
        '公告日' : 8, 
        '仕様書交付期限' : 9, 
        '質問票締切日時' : 10, 
        '資格申請締切日時' : 11,
        '入札書締切日時' : 12, 
        '開札日時' : 13, 
        '質問箇所所属/担当者' : 14, 
        '資格申請送付先' : 15, 
        '入札書送付先' : 16,
        '開札場所' : 17
    }